DataProcessors/ВводПлатежейСписком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ВводПлатежейСписком</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Платежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бокс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ПоступлениеПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеПлатежа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвитанции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ВводПлатежейСписком/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаПлатежа = ТекущаяДатаСеанса();
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если Объект.Платежи.Количество() = 0 Тогда
		Сообщить("Таблица пуста.");
	    Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("СоздатьДокументыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Создать и провести " + Объект.Платежи.Количество() + " документов ""Поступление платежа"" от " + Формат(ДатаПлатежа,"ДЛФ=D") + "?",
	РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
 Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
 	СоздатьДокументыНаСервере();
 КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	Создано = 0;
	Ошибки = 0;
	Для каждого Стр Из Объект.Платежи Цикл
	   Если Стр.Бокс.Пустая() Или Стр.Сумма <= 0 Тогда
	   	Сообщить("Строка " + Стр.НомерСтроки + ": не заполнена или неверная сумма.");
	    Ошибки = Ошибки + 1; 
		Продолжить;
	   КонецЕсли;
		НовыйДок = Документы.ПоступлениеПлатежа.СоздатьДокумент();
		НовыйДок.Дата = ДатаПлатежа;
		НовыйДок.Бокс = Стр.Бокс;
		НовыйДок.Собственник = ЭлектроУчет.СобственникБоксаНаДату(Стр.Бокс, ДатаПлатежа);
		НовыйДок.Сумма = Стр.Сумма;
		НовыйДок.СпособПоступления = СпособПоступления;
		НовыйДок.Комментарий = Стр.Комментарий;
		Попытка
			НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Создано = Создано + 1;
		Исключение
		   Сообщить("Бокс " + Строка(Стр.Бокс) + ": " + ОписаниеОшибки());
		   Ошибки = Ошибки + 1;
		КонецПопытки;
	КонецЦикла;
	Сообщить("Готово. Создано документов: " + Создано + ". Пропущено/ошибок: " + Ошибки + ".");
КонецПроцедуры
